#include <stdio.h>
#include <windows.h>
#include <conio.h>


jump(){
	printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"); 
	printf("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"); 
}

intro2(){
	jump(); 
	printf("   			TIP.   도움말  \n\n");
	printf("	서브넷 마스크 . . . . . . . : 255.255.255.0\n");
   	printf("	임대 시작 날짜. . . . . . . : 2017년 11월 19일 일요일 오전 1:57:44\n");
	printf("	-- More  --  \n");
	
	printf("\n\n  프로그램 이용중에 왼쪽 하단에 이 표시가 있는 경우, 나가고 싶으시면 'q' 를 두 번 눌러주세요.^^\n");
	printf("\n 지금 q를 두 번 눌러보세요.\n");
	getch();
	getch();
	
	
}

intro3(){
	jump();
	printf("       TIP.   도움말2\n\n");
	printf("    -- More  -- \n");
	printf("\n 프로그램 이용중에 왼쪽 하단에 이 표시가 있는 경우, 더 보실려면 '엔터'를 눌러주세요\n");
	printf("\n 지금 엔터를 눌러보세요.\n");
	getch(); 
}


ending(){
	jump();
	system("color a"); 
	system("MODE con cols=120 lines=40");
	printf("\n\n\n\n");
	
			printf("                    _____                    _____                    _____                    _____           \n"); Sleep(50);
			printf("                   /\\    \\                  /\\    \\                  /\\    \\                  /\\    \\          \n");Sleep(50);
			printf("                  /::\\____\\                /::\\____\\                /::\\    \\                /::\\____\\         \n");Sleep(50);
			printf("                 /:::/    /               /::::|   |               /::::\\    \\              /:::/    /         \n");Sleep(50);
			printf("                /:::/    /               /:::::|   |              /::::::\\    \\            /:::/    /          \n");Sleep(50);
			printf("               /:::/    /               /::::::|   |             /:::/\\:::\\    \\          /:::/    /           \n");Sleep(50);
			printf("              /:::/____/               /:::/|::|   |            /:::/__\\:::\\    \\        /:::/____/            \n");Sleep(50);
			printf("             /::::\\    \\              /:::/ |::|   |            \\:::\\   \\:::\\    \\      /::::\\    \\            \n");Sleep(50);
			printf("            /::::::\\    \\   _____    /:::/  |::|   | _____    ___\\:::\\   \\:::\\    \\    /::::::\\    \\   _____   \n");Sleep(50);
			printf("           /:::/\\:::\\    \\ /\\    \\  /:::/   |::|   |/\\    \\  /\\   \\:::\\   \\:::\\    \\  /:::/\\:::\\    \\ /\\    \\  \n");Sleep(50);
			printf("          /:::/  \\:::\\    /::\\____\\/:: /    |::|   /::\\____\\/::\\   \\:::\\   \\:::\\____\\/:::/  \\:::\\    /::\\____\\ \n");Sleep(50);
			printf("          \\::/    \\:::\\  /:::/    /\\::/    /|::|  /:::/    /\\:::\\   \\:::\\   \\::/    /\\::/    \\:::\\  /:::/    / \n");Sleep(50);
			printf("           \\/____/ \\:::\\/:::/    /  \\/____/ |::| /:::/    /  \\:::\\   \\:::\\   \\/____/  \\/____/ \\:::\\/:::/    /  \n");Sleep(50);
			printf("                    \\::::::/    /           |::|/:::/    /    \\:::\\   \\:::\\    \\               \\::::::/    /   \n");Sleep(50);
			printf("                     \\::::/    /            |::::::/    /      \\:::\\   \\:::\\____\\               \\::::/    /    \n");Sleep(50);
			printf("          	     /:::/    /             |:::::/    /        \\:::\\  /:::/    /               /:::/    /     \n");Sleep(50);
			printf("                    /:::/    /              |::::/    /          \\:::\\/:::/    /               /:::/    /      \n");Sleep(50);
			printf("          	   /:::/    /               /:::/    /            \\::::::/    /               /:::/    /       \n");Sleep(50);
			printf("                  /:::/    /               /:::/    /              \\::::/    /               /:::/    /        \n");Sleep(50);
			printf("                  \\::/    /                \\::/    /                \\::/    /                \\::/    /         \n");Sleep(50);
			printf("                   \\/____/                  \\/____/                  \\/____/                  \\/____/          \n");Sleep(50);
				
}

end(){
	jump();
         system("color a"); 
			system("MODE con cols=120 lines=40"); 
			printf("\n\n\n\n");                                                            
			printf("                     EEEEEEEEEEEEEEEEEEEEEE     NNNNNNNN        NNNNNNNN     DDDDDDDDDDDDD\n");       
			printf("                     E::::::::::::::::::::E     N:::::::N       N::::::N     D::::::::::::DDD\n");      
			printf("                     E::::::::::::::::::::E     N::::::::N      N::::::N     D:::::::::::::::DD\n");    
			printf("                     EE::::::EEEEEEEEE::::E     N:::::::::N     N::::::N     DDD:::::DDDDD:::::D\n");   
			printf("                       E:::::E       EEEEEE     N::::::::::N    N::::::N       D:::::D    D:::::D\n");  
			printf("                       E:::::E                  N:::::::::::N   N::::::N       D:::::D     D:::::D\n"); 
			printf("                       E::::::EEEEEEEEEE        N:::::::N::::N  N::::::N       D:::::D     D:::::D\n"); 
			printf("                       E:::::::::::::::E        N::::::N N::::N N::::::N       D:::::D     D:::::D\n"); 
			printf("                       E:::::::::::::::E        N::::::N  N::::N:::::::N       D:::::D     D:::::D\n"); 
			printf("                       E::::::EEEEEEEEEE        N::::::N   N:::::::::::N       D:::::D     D:::::D\n"); 
			printf("                       E:::::E                  N::::::N    N::::::::::N       D:::::D     D:::::D\n"); 
			printf("                       E:::::E       EEEEEE     N::::::N     N:::::::::N       D:::::D    D:::::D\n");  
			printf("                     EE::::::EEEEEEEE:::::E     N::::::N      N::::::::N     DDD:::::DDDDD:::::D\n");   
			printf("                     E::::::::::::::::::::E     N::::::N       N:::::::N     D:::::::::::::::DD\n");    
			printf("                     E::::::::::::::::::::E     N::::::N        N::::::N     D::::::::::::DDD\n");      
			printf("                     EEEEEEEEEEEEEEEEEEEEEE     NNNNNNNN         NNNNNNN     DDDDDDDDDDDDD\n");         
			
}


developer(){
															
															
															printf("안녕하세요. 제작자 ENNP 입니다.\n\n");
															Sleep(100);
															
															printf("네트워크에 대해 직접 방화벽 규칙을 만들어 보고,\n\n");
															Sleep(100);
															
															printf("네트워크란 이런 것이구나 라고 알아가는 시간이 되었으면 합니다.\n\n");
															Sleep(100);
															
															printf("그 이외에 다른 옵션들도 넣어 놨으니 체험해 보세요.\n\n");
															Sleep(100);
															
															printf("현재 버전 = v.3.7.23\n\n");
															Sleep(100);
															
															
															
															
}


intro(){
	
	system("color a");
			system("MODE con cols=120 lines=40");
			printf("\n\n\n\n");
			printf("                    _____                    _____                    _____                    _____           \n"); Sleep(50);
			printf("                   /\\    \\                  /\\    \\                  /\\    \\                  /\\    \\          \n");Sleep(50);
			printf("                  /::\\____\\                /::\\____\\                /::\\    \\                /::\\____\\         \n");Sleep(50);
			printf("                 /:::/    /               /::::|   |               /::::\\    \\              /:::/    /         \n");Sleep(50);
			printf("                /:::/    /               /:::::|   |              /::::::\\    \\            /:::/    /          \n");Sleep(50);
			printf("               /:::/    /               /::::::|   |             /:::/\\:::\\    \\          /:::/    /           \n");Sleep(50);
			printf("              /:::/____/               /:::/|::|   |            /:::/__\\:::\\    \\        /:::/____/            \n");Sleep(50);
			printf("             /::::\\    \\              /:::/ |::|   |            \\:::\\   \\:::\\    \\      /::::\\    \\            \n");Sleep(50);
			printf("            /::::::\\    \\   _____    /:::/  |::|   | _____    ___\\:::\\   \\:::\\    \\    /::::::\\    \\   _____   \n");Sleep(50);
			printf("           /:::/\\:::\\    \\ /\\    \\  /:::/   |::|   |/\\    \\  /\\   \\:::\\   \\:::\\    \\  /:::/\\:::\\    \\ /\\    \\  \n");Sleep(50);
			printf("          /:::/  \\:::\\    /::\\____\\/:: /    |::|   /::\\____\\/::\\   \\:::\\   \\:::\\____\\/:::/  \\:::\\    /::\\____\\ \n");Sleep(50);
			printf("          \\::/    \\:::\\  /:::/    /\\::/    /|::|  /:::/    /\\:::\\   \\:::\\   \\::/    /\\::/    \\:::\\  /:::/    / \n");Sleep(50);
			printf("           \\/____/ \\:::\\/:::/    /  \\/____/ |::| /:::/    /  \\:::\\   \\:::\\   \\/____/  \\/____/ \\:::\\/:::/    /  \n");Sleep(50);
			printf("                    \\::::::/    /           |::|/:::/    /    \\:::\\   \\:::\\    \\               \\::::::/    /   \n");Sleep(50);
			printf("                     \\::::/    /            |::::::/    /      \\:::\\   \\:::\\____\\               \\::::/    /    \n");Sleep(50);
			printf("          	     /:::/    /             |:::::/    /        \\:::\\  /:::/    /               /:::/    /     \n");Sleep(50);
			printf("                    /:::/    /              |::::/    /          \\:::\\/:::/    /               /:::/    /      \n");Sleep(50);
			printf("          	   /:::/    /               /:::/    /            \\::::::/    /               /:::/    /       \n");Sleep(50);
			printf("                  /:::/    /               /:::/    /              \\::::/    /               /:::/    /        \n");Sleep(50);
			printf("                  \\::/    /                \\::/    /                \\::/    /                \\::/    /         \n");Sleep(50);
			printf("                   \\/____/                  \\/____/                  \\/____/                  \\/____/          \n");Sleep(50);
			
			printf("\n\n\n\n\n\n\n\n\n");
			printf("     로딩중 = [ ");
			
			int loading;
			for(loading=1; loading<=90; loading++){
				printf("=");
				Sleep(10);
			}
			
			printf(" ] 100%%\n"); 
			Sleep(1000);
}

a1(){
	jump();
			printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
			printf("■    __    __      __    __       ______      __    __                                                               ■\n");
			printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
			printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
			printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
			printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
			printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
			printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
			printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
			printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
			printf("■                                                                                                                    ■\n");
			printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
			printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
			printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
			printf("  ******       \n\n\n\n");
			printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
			printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
			printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
			printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

a2(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("             *******       \n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

a3(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("                        ***************       \n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
						
}

a4(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("                                          ******************       \n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

a5(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("                                                                **********       \n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

a6(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("                                                                              ******************       \n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

a7(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n");
						printf("                                                                                                    ******************       \n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

b1(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n");
						printf("  ****************       \n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

b2(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n");
						printf("                        ****************       \n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

b3(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n");
						printf("                                            *******************       \n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

b4(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n");
						printf("                                                                    ****************************       \n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

c1(){
	
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n");
						printf("  ***************************       \n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");

}

c2(){
	
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n");
						printf("                                  **************   \n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");

}

c3(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n");
						printf("                                                    *******************   \n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

c4(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n");
						printf("                                                                            *************************   \n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

d1(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n");
						printf("  ****************   \n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

d2(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n");
						printf("                       ***********************   \n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
} 

d3(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n");
						printf("                                                   ***************************   \n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n\n\n");
}

e1(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n");
						printf("  ***********\n\n");
}


e2(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n");
						printf("                  *************\n\n");
}

e3(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n");
						printf("                                    ******\n\n");
}

e4(){
	jump();
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n"); //121
						printf("■    __    __      __    __       ______      __    __                                                               ■\n");
						printf("■   /  |  /  |    /  \\  /  |     /      \\    /  |  /  |                                                              ■\n");
						printf("■   $$ |  $$ |    $$  \\ $$ |    /$$$$$$  |   $$ |  $$ |                                                              ■\n");
						printf("■   $$ |__$$ |    $$$  \\$$ |    $$ \\__$$/    $$ |__$$ |	                                                      ■\n");
						printf("■   $$    $$ |    $$$$  $$ |    $$      \\    $$    $$ |	                                                      ■\n");
						printf("■   $$$$$$$$ |    $$ $$ $$ |     $$$$$$  |   $$$$$$$$ |                                                              ■\n");
						printf("■   $$ |  $$ | __ $$ |$$$$ | __ /  \\__$$ |__ $$ |  $$ |       [ HELP + NETWORKING + SECURITY + HACKING = H.N.S.H ]   ■\n");
						printf("■   $$ |  $$ |/  |$$ | $$$ |/  |$$    $$//  |$$ |  $$ |                                                              ■\n");
						printf("■   $$/   $$/ $$/ $$/   $$/ $$/  $$$$$$/ $$/ $$/   $$/                                                               ■\n");
						printf("■                                                                                                                    ■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n");
						printf("■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■\n\n\n");
						printf("  나가기     IP 확인    인터넷 속도 UP    사용자 컴퓨터 정보    route 확인    네트워크 연결 설정    현재 네트워크 상태\n\n\n\n\n");
						printf("  핑 날리기 [IPV4]      경로 추적 [IPV4]    IP 대역 스캔 [IPV4]     핑 자동 응답 || 막기 및 허용\n\n\n\n\n");
						printf("  방화벽의 전반적인 설정 점검     작동 모드 점검    열려 있는 포트 점검     방화벽 설정 화면으로 이동\n\n\n\n\n");
						printf("  방화벽 규칙 추가     적용된 방화벽 규칙 보기     적용된 방화벽 규칙 삭제하기\n\n\n\n\n");
						printf("  색깔 바꾸기     색깔 되돌리기     메뉴얼    제작자 말\n");
						printf("                                              *********\n\n");
}







int main(void){
	
	while(1){
		
	
			
			intro();
			intro2();
			intro3();
			system("color a"); 
			system("MODE con cols=120 lines=40");
			
			a1:	
			
			a1();
			// 72 위 75 왼쪽  77  오른 80 아래 
			// 엔터 13 // 오른쪽 왼쪽으로만 이동하게 하자 
			// 위 아래로 하니까 너무 힘ㄷ르어.. 
			// 나갈때 애니메이션 만들기 시스템 종료 모드 로그로 만들까? 
			 
				int key; 
				key = getch();
				
				if ( key == 13){ 
					jump();
					goto exit;
					
				}
				
				if(key == 224)
				{
				
					key = getch();
			
					switch(key)
					{
						
						default:{
							goto a1;
							break;
						}
						
						case 80:{
							goto a1;
							break;
						}
						
						case 72:{
							goto a1;
							break;
						}
						
						case 75:{
							goto e4;
							break;
						}
						
						case 77: { // 오른쪽 
							
							a2:
							a2();
							int key; 
							key = getch();
							
							if ( key == 13){
										
										jump();
										printf("\n");
										system("ipconfig /all | more");
										printf("\n");
										printf("\n엔터를 눌러주세요\n");
										getch();
										goto a2;
										break;
							}
							
							if(key == 224)
							{
								key = getch();
								switch(key)
								{	
								
									default:{
										goto a2;
										break;
									}
									
									case 80:{
										goto a2;
										break;
									}
									
									case 72:{
										goto a2;
										break;
									}
									
									case 75: {
										goto a1;
										break;
									}
								
									case 77: { 
										a3:
										a3();
										
										int key; 
										key = getch();
										
										if ( key == 13){
													jump();
													printf("\n");
													system("ipconfig /flushdns | more");
													printf("\n");
													printf("\n엔터를 눌러주세요\n");
													getch();
													goto a3;
													break;
										}
										if(key == 224)
										{
											key = getch();
											switch(key)
											{	
												default:{
													goto a3;
													break;
												}
												
												case 80:{
													goto a3;
													break;
												}
												
												case 72:{
													goto a3;
													break;
												}
											
												case 75: { 
													goto a2; 
													break;
												}
												
												case 77:{
													a4:
													a4();
													
													int key; 
													key = getch();
													
													if ( key == 13){
																jump();
																printf("\n");
																system("systeminfo | more");
																printf("\n");
																printf("\n엔터를 눌러주세요\n");
																getch();
																goto a4;
																break;
													}
													if(key == 224)
													{
														key = getch();
														switch(key)
														{	
															default:{
																goto a4;
																break;
															}
															
															case 80:{
																goto a4;
																break;
															}
															
															case 72:{
																goto a4;
																break;
															}
															
															case 75: { 
																goto a3;
																break;
															}
															
															case 77:{
																a5:
																a5();
																int key; 
																key = getch();
																
																if ( key == 13){
																			jump();
																			printf("\n");
																			system("route PRINT | more");
																			printf("\n");
																			printf("\n엔터를 눌러주세요\n");
																			getch();
																			goto a5;
																			break;
																}
																if(key == 224)
																{
																	key = getch();
																	switch(key)
																	{	
																		default:{
																			goto a5;
																			break;
																		}
																		
																		case 80:{
																			goto a5;
																			break;
																		}
																		
																		case 72:{
																			goto a5;
																			break;
																		}
																	
																		case 75: { 
																			goto a4; 
																			break;
																		}
																		
																		case 77:{
																			a6:
																			a6();
																			
																			int key; 
																			key = getch();
																			
																			if ( key == 13){
																						jump();
																						printf("\n");
																						system("ncpa.cpl");
																						printf("엔터를 눌러주세요\n");
																						printf("\n");
																						getch();
																						goto a6;
																						break;
																			}
																			if(key == 224)
																			{
																				key = getch();
																				switch(key)
																				{	
																					default:{
																						goto a6;
																						break;
																					}
																					
																					case 80:{
																						goto a6;
																						break;
																					}
																					
																					case 72:{
																						goto a6;
																						break;
																					}
																				
																					case 75: { 
																						goto a5;
																						break;
																					}
																					
																					case 77:{
																						a7:
																						a7();
																						int key; 
																						key = getch();
																						
																						if ( key == 13){
																									jump();
																									printf("\n");
																									system("netstat -na | more");
																									printf("\n");
																									printf("\n엔터를 눌러주세요\n");
																									getch();
																									goto a7;
																									break;
																						}
																						if(key == 224)
																						{
																							key = getch();
																							switch(key)
																							{	
																							
																								default:{
																									goto a7;
																									break;
																								}
																								
																								case 80:{
																									goto a7;
																									break;
																								}
																								
																								case 72:{
																									goto a7;
																									break;
																								}
																							
																								case 75: { 
																									goto a6; 
																									break;
																								}
																								
																								case 77: {
																									goto b1;
																									break;
																								}
																							
																								
			
																							}
																						}
																						
																						else{
																							goto a7;
																						}
																						
																					break;
																					}
																				
																				}
																			}
																			else{
																				goto a6;
																			}
																			
																		}
																		break;
																	}
																}
																else{
																	goto a5;
																}
															}
														break;
														}
													}
													else{
														goto a4;
													}
													
										      }
										      break;
										    }
								    	}
								    	else{
								    		goto a3;
										}
								    	
									}
									
									
				
								}	
							}
							
							else{
								goto a2;
							}
						}
						
						
						
						
					}
					break;
				}
				
				else{
					goto a1;
				}
				
			b1:
			b1();
			 
			key = getch();
			
			if ( key == 13){
				jump();
				
					printf("[ 사설IP목록 ] \n\n");
					printf("A 클래스 = 10.0.0.0 ~ 10.255.255.255\n");
					printf("B 클래스 = 172.16.0.0 ~ 172.31.255.255\n");
					printf("C 클래스 = 192.168.0.0 ~ 192.168.255.255\n\n");
				
					char ip[100];
					printf ("IP 주소 입력 = ");
					scanf("%s", &ip);
					
					char packet[100];
					printf("보낼 패킷 수 입력 = ");
					scanf("%s",&packet); 
					
						char ac[100];
						snprintf(ac,sizeof(ac),"ping -n %s %s", packet, ip);
						system(ac);
						printf("\n엔터를 눌러주세요\n");
					getch();
					goto b1;
			}
			
			if(key == 224)
			{
				key = getch();
				switch(key)
				{	
				
					default:{
						goto b1;
						break;
					}
						
					case 80:{
						goto b1;
						break;
					}
						
					case 72:{
						goto b1;
						break;
					}
				
					case 75: { 
						goto a7;
						break;
					}
					
					case 77:{
						b2:
						b2();
						int key; 
						key = getch();
						
								if ( key == 13){
									jump();
												printf("[ 사설IP목록 ]\n\n");
												printf("A 클래스 = 10.0.0.0 ~ 10.255.255.255\n");
												printf("B 클래스 = 172.16.0.0 ~ 172.31.255.255\n");
												printf("C 클래스 = 192.168.0.0 ~ 192.168.255.255\n\n");
												
												char ip[100];
												printf ("IP 주소 입력 = ");
												scanf("%s", &ip);
											
													char ac[100];
													snprintf(ac,sizeof(ac),"pathping %s", ip);
													system(ac);
													printf("\n엔터를 눌러주세요\n");
												getch();
												goto b2;
												break;
								}
										
								if(key == 224)
								{
									key = getch();
									switch(key)
									{	
									
										default:{
											goto b2;
											break;
										}
											
										case 80:{
											goto b2;
											break;
										}
											
										case 72:{
											goto b2;
											break;
										}
									
									
									
										case 75: { 
											goto b1;
											break;
										}
										
										case 77: {
											b3:
											b3();
											int key; 
											key = getch();
											
													if ( key == 13){
														jump();
																	printf("EX) 127.0.0 까지만 입력하시면\n\n[ 127.0.0.1 ~ 127.0.0.255 까지 스캔합니다. ]\n\n");
																	printf("[ 사설IP목록 ]\n\n");
																	printf("A 클래스 = 10.0.0.0 ~ 10.255.255.255\n");
																	printf("B 클래스 = 172.16.0.0 ~ 172.31.255.255\n");
																	printf("C 클래스 = 192.168.0.0 ~ 192.168.255.255\n\n");
																	
																	char ip[100];
																	printf ("IP 대역 입력 = ");
																	scanf("%s", &ip);
																
																
																	int num;
																	for(num = 1; num<=255; num++){
																		char ac[100];
																		snprintf(ac,sizeof(ac),"ping -n 1 %s.%d", ip, num);
																		system(ac);
																	}
																	printf("\n엔터를 눌러주세요\n");
																	getch();
																	goto b3;
																	break;
													}
															
													if(key == 224)
													{
														key = getch();
														switch(key)
														{	
														
															default:{
																goto b3;
																break;
															}
																
															case 80:{
																goto b3;
																break;
															}
																
															case 72:{
																goto b3;
																break;
															}
														
															case 75: { 
																goto b2;
																break;
															}
															
															case 77: {
																b4:
																b4();
																int key; 
																key = getch();
																
																		if ( key == 13){
																			jump();
																						
																						printf("핑 막기 = 1 | 핑 허용 = 2\n\n");
																						int aa;
																						printf("입력 = ");
																						scanf("%d",&aa); 
																						
																						if ( aa == 1){
																						
																							system("netsh firewall set icmpsetting 8 enable");
																							printf("\n엔터를 눌러주세요\n");
																							getch();
																							goto b4;
																						}
																						
																						if ( aa == 2){
																						
																							system("netsh firewall set icmpsetting 8 disable");
																							printf("\n엔터를 눌러주세요\n");
																							getch();
																							goto b4;
																						}
																						getch();
																						goto b4;
																						break;
																		}
																				
																		if(key == 224)
																		{
																			key = getch();
																			switch(key)
																			{	
																				default:{
																					goto b4;
																					break;
																				}
																					
																				case 80:{
																					goto b4;
																					break;
																				}
																					
																				case 72:{
																					goto b4;
																					break;
																				}
																			
																				case 75: { 	
																					goto b3; 
																					break;
																				}
																				
																				case 77: {
																					goto c1;
																					break;
																				}
																			}
																		}
																		else{
																			goto b4;
																		
																		}
																
																break;
															}
														}
													}
													else{
														goto b3;
													
													}
											
											
											break;
										}
									}
								}
								
								else{
									goto b2;
									
								}
						break;
					}
					
				}
			}
			
			else{
				goto b1;
				
			}
			
			
			c1:
			c1();
			
			
			key = getch();
			
			if ( key == 13){
				jump();
				
					printf("방화벽의 전반적인 설정 점검\n");
					system("netsh firewall show config | more");
					printf("\n엔터를 눌러주세요\n");
					getch();
					goto c1;
			}
			
			if(key == 224)
			{
				key = getch();
				switch(key)
				{	
				
					default:{
						goto c1;
						break;
					}
						
					case 80:{
						goto c1;
						break;
					}
						
					case 72:{
						goto c1;
						break;
					}
				
					case 75: { 
						goto b4;
						break;
					}
					
					case 77:{
						c2:
						c2();
						int key;
						key = getch();
			
						if ( key == 13){
							jump();
							
								printf("작동 모드 점검\n");
								system("netsh firewall show opmode | more");
								printf("\n엔터를 눌러주세요\n");
								getch();
								goto c2;
						}
						
						if(key == 224)
						{
							key = getch();
							switch(key)
							{	
							
								default:{
									goto c2;
									break;
								}
									
								case 80:{
									goto c2;
									break;
								}
									
								case 72:{
									goto c2;
									break;
								}
							
								case 75: { 
									goto c1;
									break;
								}
								
								case 77:{
									c3:
									c3();
									int key;
									key = getch();
						
									if ( key == 13){
										jump();
										
											printf("열려 있는 포트 점검\n");
											system("netsh firewall show state | more");
											printf("\n엔터를 눌러주세요\n");
											getch();
											goto c3;
									}
									
									if(key == 224)
									{
										key = getch();
										switch(key)
										{	
										
											default:{
												goto c3;
												break;
											}
												
											case 80:{
												goto c3;
												break;
											}
												
											case 72:{
												goto c3;
												break;
											}
										
											case 75: { 
												goto c2;
												break;
											}
											
											case 77:{
												c4:
												c4();
												int key;
												key = getch();
									
												if ( key == 13){
													jump();
														printf("방화벽 설정 화면으로 이동\n");
														system("firewall.cpl");
														printf("\n엔터를 눌러주세요\n");
														getch();
														goto c3;
												}
												
												if(key == 224)
												{
													key = getch();
													switch(key)
													{	
														default:{
															goto c4;
															break;
														}
															
														case 80:{
															goto c4;
															break;
														}
															
														case 72:{
															goto c4;
															break;
														}
													
														case 75: { 
															goto c3;
															break;
														}
														
														case 77:{
															goto d1;
															break;	
														}
													}
												}
												else{
													goto c4;
												}
														
											break;
											}
										}
									}
									else{
										goto c3;
									}
								break;
								}
							}
						}
						else{
							goto c2;
							
						}
							
					break;
					}
				}
			}
			
			else{
				goto c1;
				
			}
			
			d1:
			d1();
			
			key = getch();
			
			if ( key == 13){
				jump();
							printf("방화벽 설정 \n\n");
							printf("사설IP목록\n");
							printf("A 클래스 = 10.0.0.0 ~ 10.255.255.255\n");
							printf("B 클래스 = 172.16.0.0 ~ 172.31.255.255\n");
							printf("C 클래스 = 192.168.0.0 ~ 192.168.255.255\n\n");
						
							char action[100];
							printf("허용 및 차단\n");
							printf("입력하세요 allow or block = "); 
							scanf("%s",&action);
							printf("\n");
							
							char inout[100];
							printf("인바운드 or 아웃바운드\n");
							printf("입력하세요 in or out = "); 
							scanf("%s",&inout);
							printf("\n");
							
							char proto[100];
							printf("UDP, TCP 중 선택하세요.\n");
							printf("프로토콜 = ");
							scanf("%s",&proto); 
							printf("\n");
							
							printf("IP주소를 사용하시겠습니까? => 1번을 입력해주세요.\n");
							printf("사용한다 = 1 || 사용하지 않는다 = 2\n");
							printf("입력해주세요 = "); 
							int check;
							scanf("%d",&check); 
							
							if ( check == 2 ){
									
									char port[100];
									printf("ex) 200~300포트 => 200-300\n"); 
									printf("ex) 200,300포트 => 200,300\n"); 
									printf("포트 = ");
									scanf("%s",&port);
									
									char name[100];
									printf("규칙 이름 = ");
									scanf("%s",&name);
									printf("\n");
									
									char aa[500];
									snprintf(aa,sizeof(aa),"netsh advfirewall firewall add rule name=%s dir=%s interface=any action=%s protocol=%s localport=%s", name, inout, action, proto, port, port);
									system(aa);
									printf("\n엔터를 눌러주세요\n");
									getch();
									goto d1;
								}
							
							
							if ( check == 1 ){
								
							
							
							char ip[100];
							printf("IP 주소 =");
							scanf("%s",&ip);
							printf("\n");
							
							
							char port[100];
							printf("ex) 200~300포트 => 200-300\n"); 
							printf("ex) 200,300포트 => 200,300\n"); 
							printf("포트 = ");
							scanf("%s",&port);
						
						
							char name[100];
							printf("규칙 이름 = ");
							scanf("%s",&name);
							printf("\n");
						
							char aa[500];
							snprintf(aa,sizeof(aa),"netsh advfirewall firewall add rule name=%s dir=%s interface=any action=%s remoteip=%s protocol=%s localport=%s", name, inout, action, ip, proto, port);
							system(aa);
							printf("\n엔터를 눌러주세요\n");
							getch();
							goto d1;
							
							}
			}
						
					
			
			
			if(key == 224)
			{
				key = getch();
				switch(key)
				{	
				
					default:{
						goto d1;
						break;
					}
						
					case 80:{
						goto d1;
						break;
					}
						
					case 72:{
						goto d1;
						break;
					}
				
					case 75: { 		
						goto c4;
						break;
					}
					
					case 77: {
						d2:
						d2();
						int key;
						key = getch();
			
						if ( key == 13){
							jump();
							
								printf("적용된 방화벽 규칙 보기\n\n");
								char aa[500];
								char ab[100];
								printf("전체 다 볼려면 ALL 입력\n\n");
								printf("규칙 이름 = ");
								scanf("%s",&aa); 
								snprintf(ab,sizeof(ab),"netsh advfirewall firewall show rule name=%s | more", aa);
								system(ab);
								printf("\n엔터를 눌러주세요\n");
								getch();
								goto d2;
						}
						
						if(key == 224)
						{
							key = getch();
							switch(key)
							{	
							
								default:{
									goto d2;
									break;
								}
									
								case 80:{
									goto d2;
									break;
								}
									
								case 72:{
									goto d2;
									break;
								}
							
								case 75: { 
									goto d1;
									break;								
								}
								
								case 77: {
									d3:
									d3();
									int key;
									key = getch();
						
									if ( key == 13){
										jump();
										
											printf("적용된 방화벽 규칙 삭제하기\n\n");
											char aa[500];
											char ab[100];
											printf("전체 다 삭제 할려면 ALL 입력\n\n");
											printf("삭제할 규칙 이름 = ");
											scanf("%s",&aa); 
											snprintf(ab,sizeof(ab),"netsh advfirewall firewall delete rule name=%s", aa);
											system(ab);
											printf("\n엔터를 눌러주세요\n");
											getch();
											goto d3;
									}
									
									if(key == 224)
									{
										key = getch();
										switch(key)
										{	
											default:{
												goto d3;
												break;
											}
												
											case 80:{
												goto d3;
												break;
											}
												
											case 72:{
												goto d3;
												break;
											}
										
										
											case 75: { 
												goto d2; 
												break;
											}
											
											case 77: {
												goto e1;
												break;
											}
										}
									}
									else{
										goto d3;
									}
								break;
								}
							}
						}
						else{
							goto d2;
						}
					break;
					}
				}
			}
			else{
				goto d1;
				
			}
			
			
			
			
			e1:
			e1();
			key = getch();
			
			if ( key == 13){
				jump();				
					system("color a");
					printf("\n색깔이 바뀌었습니다.");
					printf("\n엔터를 눌러주세요\n");
					getch();
					goto e1;
			}
			
			if(key == 224)
			{
				key = getch();
				switch(key)
				{	
				
					default:{
						goto e1;
						break;
					}
						
					case 80:{
						goto e1;
						break;
					}
						
					case 72:{
						goto e1;
						break;
					}
				
				
					case 75: { 
						goto d3;
						break; 
					}
			
					case 77: {
						e2:
						e2();
						int key;
						key = getch();
			
						if ( key == 13){
							jump();				
								system("color 7");
								printf("\n색깔이 바뀌었습니다.");
								printf("\n엔터를 눌러주세요\n");
								getch();
								goto e1;
						}
						
						if(key == 224)
						{
							key = getch();
							switch(key)
							{	
								default:{
									goto e2;
									break;
								}
									
								case 80:{
									goto e2;
									break;
								}
									
								case 72:{
									goto e2;
									break;
								}
							
								case 75: { 
									goto e1;
									break; 
								}
						
								case 77: {
									e3:
									e3();
										int key;
										key = getch();
							
										if ( key == 13){
											jump();		
											
											
												printf("나가기                       => 프로그램을 종료합니다.\n\n");
												printf("IP 확인                      => IP와 MAC주소 및 다양한 네트워크 정보를 확인합니다.\n\n");
												printf("인터넷 속도 UP               => DNS 캐시를 플러시 해서 속도를 높입니다.\n\n");
												printf("사용자 컴퓨터 정보           => 내 컴퓨터 정보를 보여줍니다.\n\n");
												printf("route 확인                   => 라우트에 대한 정보를 확인합니다.\n\n");
												printf("네트워크 연결 설정           => 네트워크 설정 페이지를 보여줍니다.\n\n");
												printf("현재 네트워크 상태           => 현재 열려있는 모든 포트를 보여줍니다.\n\n");
												printf("핑 날리기 [IPV4]             => 입력한 IP로 핑을 날립니다. 패킷 수도 정할 수 있습니다.\n\n");
												printf("경로 추적 [IPV4]             => 입력한 IP로 가는 경로를 추적합니다.\n\n"); 
												printf("IP 대역 스캔 [IPV4]          => 입력한 IP 대역을 스캔합니다.\n\n");     
												printf("핑 자동 응답 || 막기 및 허용 => Echo Request 요청에 대해 응답할 것인지, 아닌지에 대해서 설정합니다.\n\n");
												printf("방화벽의 전반적인 설정 점검  => 방화벽의 전반적인 설정을 보여줍니다.\n\n");     
												printf("작동 모드 점검               => 작동 모드를 점검 합니다.\n\n");    
												printf("열려 있는 포트 점검          => 열려있는 포트를 보여줍니다.\n\n");      
												printf("방화벽 설정 화면으로 이동    => 방화벽 설정 화면으로 이동합니다.\n\n"); 
												printf("방화벽 규칙 추가             => 보안을 위해 방화벽 규칙을 추가합니다.\n\n");      
												printf("적용된 방화벽 규칙 보기      => 적용된 방화벽 규칙을 보여줍니다.\n\n");      
												printf("적용된 방화벽 규칙 삭제하기  => 적용된 방화벽 규칙을 삭제합니다.\n\n"); 
												printf("\n엔터를 눌러주세요\n");
												getch();
												goto e3;
										}
										
										if(key == 224)
										{
											key = getch();
											switch(key)
											{	
												default:{
													goto e3;
													break;
												}
													
												case 80:{
													goto e3;
													break;
												}
													
												case 72:{
													goto e3;
													break;
												}
											
											
												case 75: { 
													goto e2;
													break;
												}
												
												case 77: {
													e4:
													e4();
													int key;
													key = getch();
										
													if ( key == 13){
														jump();		
															developer();
															printf("\n엔터를 눌러주세요\n");
															getch();
															goto e4;
													}
													
													if(key == 224)
													{
														key = getch();
														switch(key)
														{	
															default:{
																goto e4;
																break;
															}
																
															case 80:{
																goto e4;
																break;
															}
																
															case 72:{
																goto e4;
																break;
															}
														
															case 75: { 
																goto e3;
																break;
															}
															
															case 77:{
																goto a1;																
																break;
															}
														}
													}
													else{
														goto e4;
													}		
													
												break;
												}
												
											}
										}
										else{
											goto e3;
										}
									
								break;
								}
							}
						}
						else{
							goto e2;
						}
						
						
					break;
					}
				}
			}
			else{
				goto e1;
			}
				
	}
	
	exit:
	
	ending();
	printf("\n\n\n\n\n\n\n\n\n");
			printf(" 프로그램 종료중 = [ ");
			
			int loading;
			for(loading=1; loading<=90; loading++){
				printf("=");
				Sleep(10);
			}
			
			printf(" ] 100%%\n"); 
			
	end();
	
	
	
	return 0;
}




